Revit 2027 API
RevitLinkType.GetTopLevelLink(Document, ModelPath) Method
 Returns the ElementId of the (top-level) linked model with the given path.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ElementId GetTopLevelLink(
	Document document,
	ModelPath path
)
Public Shared Function GetTopLevelLink (
	document As Document,
	path As ModelPath
) As ElementId
public:
static ElementId^ GetTopLevelLink(
	Document^ document,
	ModelPath^ path
)
static member GetTopLevelLink :
        document : Document *
        path : ModelPath -> ElementId
Parameters
document Document
 The document to look for the linked model in.
path ModelPath
 A path indicating which linked model to return.
Return Value
ElementId
 The id of the link with the given path, or InvalidElementId if there is no top-level link at that path.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 This function will not return nested links.
See Also
Reference
RevitLinkType Class
GetTopLevelLink Overload
Autodesk.Revit.DB Namespace